alambe94/STM32_Trinamic_Stepper/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define EN_X_Pin GPIO_PIN_5
#define EN_X_GPIO_Port GPIOC
#define STEP_X_Pin GPIO_PIN_6
#define STEP_X_GPIO_Port GPIOC
#define DIR_X_Pin GPIO_PIN_8
#define DIR_X_GPIO_Port GPIOC
#define DIAG0_X_Pin GPIO_PIN_9
#define DIAG0_X_GPIO_Port GPIOC
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define EN_Y_Pin GPIO_PIN_11
#define EN_Y_GPIO_Port GPIOC
#define DIR_Y_Pin GPIO_PIN_12
#define DIR_Y_GPIO_Port GPIOC
#define STEP_Y_Pin GPIO_PIN_2
#define STEP_Y_GPIO_Port GPIOD
#define DIAG0_Y_Pin GPIO_PIN_3
#define DIAG0_Y_GPIO_Port GPIOB
#define SPI_CS_Y_Pin GPIO_PIN_4
#define SPI_CS_Y_GPIO_Port GPIOB
#define SPI_CS_X_Pin GPIO_PIN_6
#define SPI_CS_X_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
